app/controllers/autors_controller.rb

  def index
    @autors = Autor.all
---
SELECT `autors`.* FROM `autors`

  def show
    @autor = Autor.find(params[:id])
---
SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 4) LIMIT 1

  def edit
    @autor = Autor.find(params[:id])
---
SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 4) LIMIT 1

  def create
    @autor = Autor.new(params[:autor])

    respond_to do |format|
      if @autor.save
---
INSERT INTO `autors` (`created_at`, `nome`, `updated_at`) VALUES ('2010-09-04 02:06:08', 'sdfdfdsfdsfds', '2010-09-04 02:06:08')

  def update
    @autor = Autor.find(params[:id])

    respond_to do |format|
      if @autor.update_attributes(params[:autor])
---
SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 27) LIMIT 1
UPDATE `autors` SET `nome` = 'Qualquer uma', `updated_at` = '2010-09-04 02:09:56' WHERE (`autors`.`id` = 27)

  def destroy
    @autor = Autor.find(params[:id])
    @autor.destroy
---
SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 21) LIMIT 1
DELETE FROM `autors` WHERE (`autors`.`id` = 21)