app/controllers/categorias_controller.rb

INSERT INTO `categorias` (`created_at`, `nome_categoria`, `updated_at`) VALUES ('2010-09-13 11:16:21', 'teste c', '2010-09-13 11:16:21')
---
	def create
		@categoria = Categoria.new params[:categoria]

    respond_to do |format|
      if @categoria.save

SELECT `categorias`.* FROM `categorias` WHERE (`categorias`.`id` = 5) LIMIT 1
UPDATE `categorias` SET `nome_categoria` = 'teste c22222', `updated_at` = '2010-09-13 11:41:44' WHERE (`categorias`.`id` = 5)
---
  def update
    @categoria = Categoria.find(params[:id])

    respond_to do |format|
      if @categoria.update_attributes(params[:categoria])