app/controllers/conhecimentos_controller.rb

SELECT `conhecimentos`.* FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 42) LIMIT 1
---
  def show
    @conhecimento = Conhecimento.find(params[:id])

SELECT `conhecimentos`.* FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 46) LIMIT 1
---
  def edit
    @conhecimento = Conhecimento.find(params[:id])

INSERT INTO `conhecimentos` (`autor_id`, `created_at`, `texto`, `titulo`, `updated_at`) VALUES (NULL, '2010-08-31 11:51:37', NULL, NULL, '2010-08-31 11:51:37')
---
  def create
    @conhecimento = Conhecimento.new(params[:conhecimento])

    respond_to do |format|
      if @conhecimento.save

SELECT `conhecimentos`.* FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 248) LIMIT 1
UPDATE `conhecimentos` SET `titulo` = 'tesaaaa', `updated_at` = '2010-09-03 11:06:55' WHERE (`conhecimentos`.`id` = 248)
---
  def update
    @conhecimento = Conhecimento.find(params[:id])

    respond_to do |format|
      if @conhecimento.update_attributes(params[:conhecimento])

SELECT `conhecimentos`.* FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 48) LIMIT 1
DELETE FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 48)
---
  def destroy
    @conhecimento = Conhecimento.find(params[:id])
    @conhecimento.destroy