app/controllers/conhecimentos_controller.rb

SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 16) LIMIT 1
---
	def index
		@autors = Autor.find(:all, :order => "id DESC")