app/controllers/home_controller.rb

SELECT `conhecimentos`.* FROM `conhecimentos` WHERE (`conhecimentos`.`id` = 'titulo') LIMIT 1
SELECT `autors`.* FROM `autors` WHERE (`autors`.`id` = 16) LIMIT 1
---
  def index
	@conhecimentos = Conhecimento.find (:all, :select => "id, titulo, autor_id")
	@autors = Autor.find(:all)