app/controllers/home_controller.rb

  def index
	@conhecimentos = Conhecimento.paginate :page=>params[:pagina_conhecimentos], :order => "id DESC", :select => "id, titulo, autor_id, categoria_id"
	@autors = Autor.paginate :order => "id DESC", :page => params[:pagina_autores]
	@categorias = Categoria.paginate :order => "id DESC", :page => params[:pagina_categorias]
---
SELECT COUNT(*) AS count_id FROM `conhecimentos`
SELECT id, titulo, autor_id, categoria_id FROM `conhecimentos` ORDER BY id DESC LIMIT 0, 10
SELECT COUNT(*) AS count_id FROM `autors`
SELECT `autors`.* FROM `autors` ORDER BY id DESC LIMIT 0, 30
SELECT COUNT(*) AS count_id FROM `categorias`
SELECT `categorias`.* FROM `categorias` ORDER BY id DESC LIMIT 0, 30

  def pesquisa
	@autors = Autor.paginate :order => "id DESC", :page => params[:pagina_autores]
---
SELECT COUNT(*) AS count_id FROM `autors`
SELECT `autors`.* FROM `autors` ORDER BY id DESC LIMIT 0, 10